<script setup>
import { useI18n } from 'vue-i18n'
import { ref } from 'vue';

const { t } = useI18n()

</script>

<template>
    <div class="wrapper main_wrapper t_c">
        <img src="/img/title_terms_of_service.png" class="title m_b_30" />
        <div class="p_r f_0">
            <div class="see_through_block p_r m_15 p_10">
                <div class="t_l">
                    <div class="basic_block m_b_5 p_10">
                        <div class="p_3 t_l f_12 break">
                            该舞萌DX科技专页
                            使用条款（以下简称“本协议”）阐明了由世嘉废物股份有限公司（以下简称“公司”）提供“舞萌DX科技专页”服务（以下简称“服务”）的使用条款和条件。服务用户（以下简称“用户”）应确认并接受本协议的规定，以使用服务。
                            <br><br>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第1条（协议的适用）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>本协议旨在确立公司与用户之间使用服务的合同权利和义务，并且适用于公司与用户之间与使用服务相关的所有关系。</li>
                                <li class="m_t_5">公司在服务网站（“服务网站”）上发布的服务的规则、准则、法规、注释、解释和其他法规应构成本协议的一部分。</li>
                                <li class="m_t_5">公司可因各种原因而随时变更、添加或删除本协议的任何条款，而无需事先通知用户。
                                    当公司将修订后的条款内容发布到服务网站上时，该等变更、添加或删除的条款将立刻生效。
                                    若用户继续使用服务的话，公司将视用户为已认可修订后的协议。</li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第2条（服务内容）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>服务中所提供的功能是和公司的街机游戏「舞萌 DX」中相互关连的。服务的详细信息已列出在服务的网站中。</li>
                                <li class="m_t_5">公司可在不事先通知用户的情况下全部或部分变更服务内容。<br>对于变更引起的用户损失或后果，本公司概不负责。</li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第3条（用户注册）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>希望使用服务的人（“申请人”）应在同意本协议并在服务网站上输入指定信息后，提交使用服务的申请。</li>
                                <li class="m_t_5">当公司在服务网站上显示前款申请已完成时，代表公司与申请人之间已同意并落实本协议条款和条件下的《服务使用合同》，届时用户注册也完成。</li>
                                <li class="m_t_5">如果申请人是未成年人（20岁以下）或其他限制民事行为能力人，则应在其监护人（包括父母）的同意下，申请使用服务。
                                    当该申请人申请使用服务时，公司应认为其监护人已同意申请人的申请。</li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第4条（用户解除）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            用户可以随时在服务网站上，通过公司另行规定的方式解除《服务使用合同》。
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第5条（使用环境）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            用户应自行承担责任和费用，准备使用服务所需的所有环境，包括通信设备、软件和通信线路。公司对因此类环境引起的任何损失概不负责。
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第6条（ID和密码的管理）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>用户在服务中注册的ID和密码（“密码”）应仅由用户使用，不得由任何第三方使用，也不得转让、分发或以其他方式处置。</li>
                                <li class="m_t_5">用户应对密码的使用、存储和其他管理负个人责任。如果因为被第三方使用密码而对用户造成的任何损害，公司概不负责。</li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第7条（信息的传播）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>用户应授予公司免费、非排他性的权利，允许复制、公开传输（包括制作可传输的形式）以及以其他方式分发通过服务传输（上传）的信息（“用户数据”）。
                                    如果此类信息涉及著作权，则用户不得向公司主张该等著作权的人身权利。</li>
                                <li class="m_t_5">除非公司另有规定，否则用户不得在用户数据中包含个人信息（尤其要注意，不要包括可以客观识别个人用户的信息）。</li>
                                <li class="m_t_5">
                                    关于用户数据，用户不得传播以下信息：侵犯第三方权利的；违反法律法规的；违反公共秩序和道德的；通常会导致其他用户反感的；针对销售、政治目的、或宗教活动的；或会妨碍服务正常运作的信息。<br>
                                    当公司确定用户数据符合或有机会符合上述任何条件时，公司可以在不事先通知用户的情况下，有权更改或删除部分或全部用户数据。但是，公司没有进行此类更改或删除的义务。</li>
                                <li class="m_t_5">如果公司暂停提供服务或解除《服务使用合同》，或者用户终止了《服务使用合同》，则公司可以立即删除用户数据。</li>
                                <li class="m_t_5">
                                    用户应自行负责备份或存储用户数据，公司对由任何原因（包括但不限于服务的停止、暂停、取消或终止）所导致的用户数据消除、删除、损坏或丢失概不负责。</li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第8条（禁止事项）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>用户在使用服务时，不得从事以下或可能属于以下任何情况的行为。
                                    <ol class="bracket">
                                        <li>侵犯知识产权（包括著作权、设计权、专利、实用新型权和商标）或第三方或公司拥有的任何其他权利；</li>
                                        <li>侵犯第三方或公司的财产、信誉、声誉、隐私或肖像权；</li>
                                        <li>有商业、政治或宗教目的；</li>
                                        <li>违反公共秩序和道德的行为，或者是鼓励这种行为的行为；</li>
                                        <li>违反法律法规的行为，或者煽动、协助、招揽前述行为的行为；</li>
                                        <li>除事先假定或允许作为使用服务方法以外的行为；</li>
                                        <li>使用未经本公司批准使用服务的自动化工具（宏工具）和程序，宏或其他工具；</li>
                                        <li>进行服务的解析、变更、修改、逆向工程等；</li>
                                        <li>有意更改服务的内容、进程、组成等，例如在使用服务时更改原始操作；</li>
                                        <li>促使其他用户或第三方使用、分发（包括制作可传送的形式）或鼓励能够实施禁止行为的程序或数据，无论服务是否正在使用；</li>
                                        <li>非法访问或干扰与服务相关设施的使用或操作（通信设施、通信线路、计算机以及公司为提供服务而准备的其他设备和软件）；</li>
                                        <li>大大增加与服务相关的服务器或网络的负担，并影响了服务的正常运作；</li>
                                        <li>妨碍游戏、本公司或其集团公司提供的服务，游戏或服务的行为；</li>
                                        <li>违反本协议的行为；和</li>
                                        <li>除上述各项以外，公司认为不适当的其他行为。</li>
                                    </ol>
                                </li>
                                <li class="m_t_5">用户不得利用服务中的任何缺陷从而以不公平的方式在游戏中获取利益。
                                    如果发现此类缺陷，则用户不得将此类缺陷通知或发布给任何第三方，并且应将该缺陷报告给公司单独指定的联系地址。</li>
                                <li class="m_t_5">
                                    如果由于上段各项规定的任何违禁行为引起任何第三方的投诉、问题、索赔或争议（以下简称“争议”），则用户应自行承担解决争议的责任和费用，并且不得对公司造成任何损害。
                                    此外，对于用户因为争议而导致的任何损害，公司概不负责。</li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第9条（使用限制）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>如果公司确定用户属于或可能属于以下情况，则公司可以立即暂停全部或部分向用户所提供的服务（包括但不限于更改或删除用户数据）和解除《使用服务合同》，将并不另行通知或请求。
                                    <ol class="bracket">
                                        <li>用户在服务里公司所指定事项中输入全部或部分虚假、不正确或错误的内容；</li>
                                        <li>用户过去曾被暂停使用公司或其集团公司所提供的服务或他类似措施；</li>
                                        <li>发现用户是有组织犯罪集团、反政府组织或其他反社会组织或其成员或有关人员，或者与该集团或个人有任何关系；</li>
                                        <li>未得到监护人（包括父母）同意的未成年人（20岁以下）或其他限制民事行为能力人，根据本协议使用服务；</li>
                                        <li>符合本协议第8条（禁止事项）第1款或违反本协议的任何规定；</li>
                                        <li>通过超出法律责任范围的暴力胁迫、不合理要求、散布谣言、欺诈或武力方式破坏公司信誉或干扰公司业务；</li>
                                        <li>除上述事项外，当出现公司认为不宜提供服务的其他情形。</li>
                                    </ol>
                                </li>
                                <li class="m_t_5">对于根据本条第1款暂停服务或解除《服务使用合同》而导致的用户或第三方任何损害或后果，公司概不负责。</li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第10条（服务中止）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>如果发生以下任何情况，公司可在不事先通知用户的情况下全部或部分暂停或终止服务；
                                    <ol class="bracket">
                                        <li>当服务因故障或其他与服务相关的设施原因（通信设施、通信线路、计算机以及公司为提供服务而提供的其他设备和软件，以下本条同样适用）而无法使用时；</li>
                                        <li>定期或紧急进行与服务相关设施的维护、检查、修理或变更时；</li>
                                        <li>因火灾、停电等原因而无法使用服务时；</li>
                                        <li>因地震、洪水、海啸或其他自然灾害而无法使用服务时；</li>
                                        <li>因战争、暴乱、骚乱、劳资纠纷、流行病的传播或其他不可抗力而无法使用服务时；</li>
                                        <li>由于法律法规，司法命令等的限制而无法使用服务时；</li>
                                        <li>当公司出于运营和技术等问题而判定有必要时。</li>
                                    </ol>
                                </li>
                                <li class="m_t_5">对于用户或任何第三方根据前款因暂停或终止服务而造成的任何损害或后果，本公司概不负责。</li>
                                <li class="m_t_5">即使根据前款规定暂停或终止服务，公司也不退还使用费。</li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第11条（损害）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>服务所提供的功能有可能包括完整性、准确性、实用性、可靠性等方面的缺陷。因此，公司不保证此类服务内容、使用以及服务信息等的完整性、准确性、实用性、可靠性，包括在使用时服务是否能一直处于良好的网络连接等，公司不会对以上事宜作出保证并有免责的权利。
                                </li>
                                <li class="m_t_5">
                                    尽管有前款的规定，当用户因使用服务而遭受损害，而公司会对该等损害负上责任时，损害赔偿的范围应仅限于因使用本服务而造成的实际损害和直接损害。<br>
                                    公司对因特殊情况引起的损害、利润损失、间接损害或任何其他损害，包括目前可以预计与否的各种损害赔偿，公司一律不承担任何责任。且此类责任的金额不得超过用户实际支付的使用费等总额。但是，前述情况不适用于公司有故意或重大过失的情况。
                                </li>
                                <li class="m_t_5">对于除本公司以外的第三方因使用本服务而采取的任何行动或提供的任何服务，本公司概不负责。</li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第12条（个人信息）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            如果公司在使用服务时获得了用户的个人信息（有关可从该信息中识别特定个人的个体信息），则该公司应遵守《个人信息保护法》并处理根据公司另外制定的《隐私政策》（个人信息保护基本政策）的规定。
                            公司仅在提供和操作服务所需的范围内使用用户的个人信息。 此外，公司可以要求第三方在提供和运行服务所需的范围内适当管理此类个人信息，从而向其委托其业务的第三方提供个人信息。
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第13条（著作权和其他知识产权）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>除非另有说明，否则构成服务的所有信息、程序、软件、商标和商品名称，以及著作权、商标、其他知识产权和与之相关的其他权利，均应属于公司或获得正式授权的第三方。</li>
                                <li class="m_t_5">
                                    未经公司和第三方权利人的事先明确许可，用户不得使用全部或部分通过使用服务获得的超出私人使用范围的信息，无论该使用是通过复制、出版、广播、公共传播还是其他方式获得的。
                                </li>
                            </ol>
                        </div>
                        <div class="m_b_5 p_3 t_l f_15"><b>第14条（管辖范围）</b></div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="p_15 t_l f_12 break">
                            <ol>
                                <li>本协议包括其成立、效力、解释和履行应适用日本法律和法规。</li>
                                <li class="m_t_5">即使本协议的一部分被消费者保护法律法规的强制性规定或其他强制性规定被视为无效，在不违反强制性规定的情况下，其应在最大程度上有效。</li>
                                <li class="m_t_5">日本东京地方法院对用户与本公司之间与本协议有关的可能发生的所有纠纷、争议或分歧拥有专属管辖权。</li>
                            </ol>
                        </div>
                        <img src="/img/line_01.png" class="w_396" />
                        <div class="m_t_10 p_3 t_r f_13">于2020年1月10日制定并实施</div>
                        <div class="m_b_5 p_3 t_r f_13"></div>
                    </div>
                </div>
            </div>
        </div>
        <img src="/img/line_02.png" class="w_450" />
        <div class="t_c">
            <button type="button" onclick="history.back();" class="f_0"><img
                    src="/img/btn_back.png" class="w_80 m_t_10" /></button>
        </div>
    </div>
</template>


<style scoped></style>
